title: BITSAdmin Suspicious File Download
id: 9bb3e540-2f77-4c99-b30c-c2c314e0d142
description: Detects use of bitsadmin.exe to download files – a legacy but still-abused LOLBin technique for fetching payloads stealthily.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: '\\bitsadmin.exe'
    CommandLine|contains:
      - '/transfer'
      - 'http://'
      - 'https://'
  condition: selection
level: medium
tags:
  - attack.command_and_control
  - attack.t1197
  - sigma.detection
falsepositives:
  - scheduled enterprise update or patching systems using BITS
references:
  - https://attack.mitre.org/techniques/T1197/
