title: Certutil Download or Decode File
id: 91d909ec-7636-4a3c-b292-3ac2c609165f
description: Detects certutil.exe used to download remote files or decode base64-encoded payloads.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: '\\certutil.exe'
    CommandLine|contains:
      - '-urlcache'
      - '-decode'
      - 'http://'
      - 'https://'
  condition: selection
level: high
tags:
  - attack.command_and_control
  - attack.t1105
falsepositives:
  - certificate management scripts (rare)
references:
  - https://attack.mitre.org/techniques/T1105/
