title: Cmstp INF Execution Proxy Technique
id: 1dbf6a84-9056-4a6b-9e6b-d39ed57cfc6e
description: Detects cmstp.exe being used to execute a malicious INF configuration file as a proxy for code execution.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: '\\cmstp.exe'
    CommandLine|contains:
      - '.inf'
      - '/au'
  condition: selection
level: high
tags:
  - attack.defense_evasion
  - attack.t1218.003
falsepositives:
  - legacy network config deployment
references:
  - https://attack.mitre.org/techniques/T1218/003/
