title: InstallUtil Abuse for Code Execution
id: 2f08f4a2-bef1-4e03-9460-0041e3b306f1
description: Detects installutil.exe being used to run custom .NET assemblies which may execute arbitrary code.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: '\\installutil.exe'
  condition: selection
level: high
tags:
  - attack.defense_evasion
  - attack.t1218.004
falsepositives:
  - dev environments compiling/testing .NET binaries
references:
  - https://attack.mitre.org/techniques/T1218/004/
