title: Msiexec Silent Remote Installation
id: a9ff9f65-9617-4376-a22c-f2f69c1d1f99
description: Detects msiexec.exe executing a remote MSI package with /quiet or /qn parameters, often seen in silent installs or malware delivery.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: '\\msiexec.exe'
    CommandLine|contains:
      - '/quiet'
      - '/qn'
      - 'http://'
      - 'https://'
  condition: selection
level: medium
tags:
  - attack.defense_evasion
  - attack.t1218.007
falsepositives:
  - legitimate enterprise deployments or updates
references:
  - https://attack.mitre.org/techniques/T1218/007/
