title: Rundll32 Execution of Script Engine
id: 5b40f86a-bd58-486c-a2f9-b9cbb5d45594
description: Detects rundll32.exe executing scripting engines (e.g. JavaScript or VBScript) via DLL or COM references – a known technique for stealthy code execution.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: '\\rundll32.exe'
    CommandLine|contains:
      - 'javascript:'
      - 'vbscript:'
      - 'mshtml.dll'
  condition: selection
level: high
tags:
  - attack.execution
  - attack.defense_evasion
  - attack.t1218.011
  - sigma.detection
falsepositives:
  - legitimate automation or dev/test usage
references:
  - https://attack.mitre.org/techniques/T1218/011/
