title: Explorer Spawning PowerShell
id: 2e6fb4a3-5a0e-4b64-b3f2-3c8f792ac604
description: Detects explorer.exe launching PowerShell, which can be suspicious depending on context.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    ParentImage|endswith: '\\explorer.exe'
    Image|contains: 'powershell'
  condition: selection
level: medium
tags:
  - attack.execution
  - attack.t1059.001
  - tldrplus
falsepositives:
  - users opening terminals for automation
references:
  - https://attack.mitre.org/techniques/T1059/001/
