title: WMIC Spawning PowerShell
id: 183c7c84-85db-4eb5-8f90-998abf8d5174
description: Detects WMIC (WMI command-line tool) launching PowerShell, which may indicate abuse for execution or fileless attacks.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    ParentImage|endswith: '\\wmic.exe'
    Image|contains: 'powershell'
  condition: selection
level: medium
tags:
  - attack.execution
  - attack.t1047
  - attack.t1059.001
  - sigma.detection
falsepositives:
  - misconfigured scripts using WMIC to launch tools
references:
  - https://attack.mitre.org/techniques/T1047/
