title: WScript or CScript Launching VBS or JS Script
id: 214ce12f-173a-4a0c-a949-99cb343c7593
description: Detects wscript.exe or cscript.exe executing .vbs, .js, or similar script files.
status: experimental
author: Wojciech Ciemski
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith:
      - '\\wscript.exe'
      - '\\cscript.exe'
    CommandLine|contains:
      - '.vbs'
      - '.js'
      - '.jse'
  condition: selection
level: medium
tags:
  - attack.execution
  - attack.t1059.005
falsepositives:
  - logon scripts
  - legitimate admin automation
references:
  - https://attack.mitre.org/techniques/T1059/005/
