title: TEMPLATE - Describe the behavior here
id: CHANGE-ME
status: test
description: |
  This is a template rule. Replace this description
  with what your rule is meant to detect.
author: YOUR NAME
license: MIT
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    # Add your key:value pairs here
  condition: selection
falsepositives:
  - TODO
level: medium
tags:
  - attack.tXXXX
