title: Multiple Failed SSH Login Attempts
id: 9af0c7c7-7f64-489a-ae83-d373a340fd3b
status: test
description: Detects repeated failed SSH authentication attempts, a potential sign of brute-force or credential stuffing attack.
author: Wojciech Ciemski
date: 2025/07/30
license: MIT
logsource:
  product: linux
  service: auth
  category: authentication
detection:
  selection:
    EventID: 22
    Message|contains|all:
      - 'sshd'
      - 'Failed password'
  condition: selection
falsepositives:
  - user misremembering password
  - automated config deployment tools
level: low
tags:
  - attack.credential_access
  - attack.brute_force
  - attack.t1110.001
